Repository: KristofferSimlin/SERA_Home
Catalog: l10n/app_*.arb
Languages: sv

# startCta
source: Enter
sv: Logga in - test

# startLoginBusiness
source: Log in - business
sv: Logga in - företag

# startLoginPersonal
source: Log in - personal
sv: Logga in - privat

# businessLoginTitle
source: Business login
sv: Företagsinloggning

# businessLoginBody
source: Licenses are purchased separately. Use your company login link or SSO. If you need help, contact your administrator.
sv: Licenser köps separat. Använd företagets inloggningslänk eller SSO. Behöver du hjälp, kontakta din administratör.

# businessLoginButton
source: Continue to log in
sv: Fortsätt till inloggning

# businessLoginUsername
source: Username
sv: Användarnamn

# businessLoginPassword
source: Password
sv: Lösenord

# businessLoginSubmit
source: Sign in
sv: Logga in

# businessLoginFooter
source: Don’t have an account? Contact your admin.
sv: Saknar du konto? Kontakta er administratör.

# personalPricingTitle
source: Personal access
sv: Privat åtkomst

# personalPricingBody
source: Personal users subscribe via App Store or Google Play. If you have already logged in on this device, you'll go straight into the app.
sv: Privata användare tecknar via App Store eller Google Play. Om du redan har loggat in på den här enheten kommer du direkt in i appen.

# personalPricingTrial
source: 7-day free trial, then 29/month.
sv: 7 dagars gratis test, därefter 29 kr/månad.

# personalPricingSubscribe
source: Start 7 days free – 29/month
sv: Starta 7 dagar gratis – 29 kr/mån

# personalPricingOpenApp
source: I’ve already purchased – open the app
sv: Jag har redan köpt – öppna appen

# termsTitle
source: Terms of Use
sv: Användarvillkor

# termsBody
source: TERMS OF USE — SERA Version: 2025-11-03 Applies to: The SERA app and related services (“Service”) Provider: SimlingGroup SERA Address: Ullevivägen 45, 746 51 Bålsta Contact: support@sera.chat 1. About the Service SERA is a troubleshooting and service assistant for equipment. The app offers chat-based guidance with a focus on safety and can show sources/disclaimers. The Service may integrate third-party AI providers and our curated knowledge library (“SERA’s library”) to improve answer quality. Important safety notice: SERA does not replace OEM manuals, training, or certified expertise. Always follow local safety rules, lockout/tagout (LOTO), and manufacturer instructions. Use the Service at your own risk. 2. Eligibility You must be: • At least 16 years old (or higher as required by local law); and • authorized to enter into agreements. Business users confirm they use the Service within their employer/organization and follow internal policies. 3. Account and access • Individuals: May purchase a subscription in-app via App Store/Google Play. • Business: Access via enterprise license (agreement) and login (e.g., SSO/email). You are responsible for accurate, up-to-date info and for protecting login credentials. 4. Acceptable use (prohibited behavior) You may not: • bypass security features or overload the Service (e.g., scraping, rate-limit bypass), • use the Service for unlawful purposes, share harmful content, or infringe others’ rights, • attempt to recreate, decompile, or reverse engineer the Service, models, or library. 5. AI answers and SERA’s library When you ask a question, relevant content (incl. selected brand/model/year) is sent to our server/proxy. The server can: 1. Search SERA’s library (manuals, service bulletins we’re allowed to use), 2. forward the minimum necessary excerpts + your question to a third-party AI provider, 3. compile the answer for you, often with source references. We configure the provider so data is not used for general model training where such controls exist. Logs may be retained briefly for security/abuse detection. All communication uses HTTPS. See the Privacy Policy for more details. 6. Privacy and data All personal data processing is described in our Privacy Policy. It is part of these terms. 7. Intellectual property The SERA app, graphics (including logos), and SERA’s library are owned by SimlingGroup or our licensors. You get a limited, non-exclusive, non-transferable license to use the Service under these terms. Any other use requires our written consent. 8. User content If you upload text/images/logs, you grant us a global, non-exclusive license to process them only to deliver the Service (including troubleshooting, support, security). You are responsible for having the rights to share the material and ensuring it doesn’t violate law or third-party rights. 9. Beta features Features marked “Beta” may be unfinished and can change or be removed without notice. Use Beta at your own risk. 10. Interruptions and changes We may perform scheduled maintenance, update features, or change the Service. For major changes, we aim to inform in advance. 11. Liability and disclaimer The Service is provided “as is.” To the extent permitted by law, we disclaim indirect damages (e.g., production loss, consequential damages, data loss). Our aggregate liability is limited to what you paid in the last 12 months for the Service (except where mandatory consumer law gives you greater protection). 12. Consumer rights (individuals) Nothing in these terms limits your mandatory rights under applicable consumer law. Subscriptions purchased via App Store/Google Play are governed by each store’s terms and refund processes. 13. Termination and suspension You may stop using the Service at any time. We may suspend or terminate access for violations, security/abuse risk, or non-payment. For consumer subscriptions, see Subscription Terms. 14. Changes to terms We may update these terms. For significant changes, we will inform you in the app or by email. Continued use after effective date means you accept the changes. 15. Governing law and dispute resolution Swedish law applies. Disputes are resolved by Swedish courts (e.g., Stockholm District Court) unless mandatory consumer law states otherwise. 16. Contact Questions about the Service or terms: support@sera.chat
sv: ANVÄNDARVILLKOR — SERA Version: 2025-11-03 Gäller för: SERA-appen och tillhörande tjänster (“Tjänsten”) Leverantör: SimlingGroup SERA Adress: Ullevivägen 45, 746 51 Bålsta Kontakt: support@sera.chat 1. Om Tjänsten SERA är en felsöknings- och serviceassistent för maskiner/utrustning. Appen erbjuder chattbaserad vägledning med säkerhetsfokus och kan visa källor/disclaimers. Tjänsten kan integrera tredjeparts AI-leverantörer och ett eget kuraterat kunskapsbibliotek (“SERA:s bibliotek”) för att förbättra svarens kvalitet. Viktig säkerhetsnotis: SERA ersätter inte tillverkarens manualer, utbildning eller certifierad fackkunskap. Följ alltid lokala säkerhetsregler, låsning/avstängning (LOTO) och tillverkarens instruktioner. Använd Tjänsten på eget ansvar. 2. Behörighet Du behöver vara: • Minst 16 år (eller högre ålder enligt lokal lag), och • behörig att ingå avtal. Företagsanvändare intygar att de använder Tjänsten inom ramen för sin arbetsgivare/organisation och följer interna policyer. 3. Konto och åtkomst • Privatpersoner: Kan köpa prenumeration i appen via App Store/Google Play. • Företag: Får åtkomst via företagslicens (avtal) och inloggning (t.ex. SSO/e-post). Du ansvarar för korrekt och uppdaterad kontoinformation samt för att skydda inloggningsuppgifter. 4. Acceptabel användning (förbjudet beteende) Du får inte: • kringgå säkerhetsfunktioner eller belasta Tjänsten orimligt (t.ex. scraping, rate-limit-bypass), • använda Tjänsten i olagligt syfte, dela skadligt innehåll eller kränka andras rättigheter, • försöka återskapa, dekompilera eller reverse-engineera Tjänstens system, modeller eller bibliotek. 5. AI-svar och SERA:s bibliotek När du ställer en fråga skickas relevant innehåll (inkl. valda märke/modell/år) till vår server/proxy. Servern kan: 1. Söka i SERA:s bibliotek (manualer, servicebulletiner m.m. som vi har rätt att använda), 2. vidarebefordra minsta nödvändiga utdrag + din fråga till en tredjeparts AI-leverantör, 3. sammanställa svaret till dig, ofta med källhänvisningar. Vi konfigurerar leverantören så att data inte används för generell modellträning där sådana kontroller finns. Loggar kan behållas kort tid för säkerhet/missbruksdetektion. All kommunikation sker över HTTPS. Se vidare i Integritetspolicyn. 6. Integritet och data All personuppgiftsbehandling beskrivs i vår Integritetspolicy (Privacy Policy). Den är en del av dessa villkor. 7. Immateriella rättigheter SERA-appen, grafiska element (inkl. logotyper) och SERA:s bibliotek ägs av Simlingroup eller våra licensgivare. Du får en begränsad, icke-exklusiv, icke-överlåtbar licens att använda Tjänsten enligt dessa villkor. All annan användning kräver vårt skriftliga medgivande. 8. Innehåll från användare Om du laddar upp text/bilder/loggar i Tjänsten ger du oss en global, icke-exklusiv licens att behandla detta endast i syfte att leverera Tjänsten (inkl. felsökning, support och säkerhet). Du ansvarar för att du har rätt att dela materialet och att det inte bryter mot lag eller tredje mans rätt. 9. Beta-funktioner Märkta “Beta” kan vara ofärdiga och ändras eller avvecklas utan föregående meddelande. Du använder Beta på egen risk. 10. Avbrott och ändringar Vi kan göra schemalagt underhåll, uppdatera funktioner eller ändra Tjänsten. Vid större ändringar försöker vi informera i förväg. 11. Ansvarsbegränsning och friskrivning Tjänsten tillhandahålls ”i befintligt skick”. I den utsträckning lagen tillåter friskriver vi oss från indirekta skador (t.ex. produktionsbortfall, följdskador, dataförlust). Vår sammanlagda ansvarsnivå är begränsad till vad du betalat de senaste 12 månaderna för Tjänsten (gäller inte när tvingande konsumentlag ger dig högre skydd). 12. Konsumenträtt (gäller privatpersoner) Ingenting i dessa villkor begränsar dina tvingande rättigheter enligt gällande konsumentlagstiftning (t.ex. distansavtalslagen i Sverige). Prenumerationer som köps via App Store/Google Play hanteras enligt respektive butiks villkor och återbetalningsprocesser. 13. Uppsägning och avstängning Du kan sluta använda Tjänsten när som helst. Vi kan stänga av eller säga upp åtkomsten vid brott mot villkoren, risk för säkerhet/missbruk eller utebliven betalning. För privatprenumeration: se Prenumerationsvillkor. 14. Ändringar av villkor Vi kan uppdatera dessa villkor. Vid väsentliga ändringar informerar vi i appen eller via e-post. Fortsatt användning efter ikraftträdandet innebär att du godtar ändringarna. 15. Tillämplig lag och tvist Svensk lag gäller. Tvist avgörs av svensk allmän domstol med [valfri: Stockholms tingsrätt] som första instans, om inte tvingande konsumenträtt anger annat. 16. Kontakt Frågor om Tjänsten eller villkoren: support@sera.chat

# subscriptionTitle
source: Subscription Terms
sv: Prenumerationsvillkor

# subscriptionBody
source: SUBSCRIPTION TERMS — SERA Version: 2025-11-03 Applies to individual in-app purchases via App Store/Google Play and enterprise licenses via agreement. 1. Scope These terms govern payment, renewal, cancellation, and refunds for: • Individual subscription (IAP): bought in-app via App Store or Google Play. • Enterprise license: purchased outside the app via agreement/invoice (per organization and/or per user). 2. Plans and pricing • Individual: monthly subscription, preliminarily 29/month (incl. VAT). The exact price is shown in App Store/Google Play for your region. • Enterprise: plan/pricing per quote or price list (e.g., per seat or tier). Minimum fees and volume discounts may apply. We may change prices/plans going forward. For individual subscriptions, we follow App Store/Google Play rules for price increases (notice + option to decline). 3. Payment • Individual (IAP): Payment handled by App Store/Google Play with your store account. We do not accept direct payment in-app for the consumer path. • Enterprise: Invoice/Stripe per agreement (e.g., net 30). Late payment may incur interest and/or suspension. 4. Term and renewal • Subscription runs monthly from purchase and auto-renews until canceled. • Enterprise licenses run per agreement (monthly/annual) and renew per contract terms. 5. Manage/cancel subscription • iOS (App Store): Settings → your name → Subscriptions → SERA → Cancel. • Android (Google Play): Google Play → profile → Payments & subscriptions → Subscriptions → SERA → Cancel. Cancellation applies from next period. Access remains until the current paid period ends. 6. Right of withdrawal and refunds (consumer) • Withdrawal: In EU/SE, digital subscriptions may have a 14-day withdrawal right. App Store/Google Play handle this in their systems. • If you consent to immediate delivery of digital content, withdrawal may be affected per law/store terms. • Refunds: Request via App Store/Google Play. We normally do not issue direct refunds for IAP purchases. 7. Enterprise: seats/users • License applies to the organization. Admin may assign seats to users. • You must ensure only authorized users access the license and that credentials are shared per agreement (not between individuals unless allowed). • We may apply fair use and technical limits (API quotas, concurrency). 8. Access and suspension • For unpaid invoices/unauthorized use, access may be limited or suspended. • If your store account lacks an active subscription (individual) or your org license lapses (enterprise), the Service may stop working until payment/agreement is reactivated. 9. Changes to subscription terms We may update these terms. For significant changes, we will inform in the app/email and/or via store notices. Continued use after effective date means you accept the changes. 10. Support and contact • Technical support & billing (SimlingGroup): support@sera.chat • IAP purchases (individual): Primarily handled via App Store/Google Play. • Address: Ullevivägen 45, 746 51 Bålsta
sv: PRENUMERATIONSVILLKOR — SERA\n\nVersion: 2025-11-03\nGäller privata prenumerationer via App Store/Google Play och företagslicenser via avtal.\n\n1. Omfattning\n\nDessa villkor reglerar betalning, förnyelse, avbokning och återbetalning för:\n• Privat prenumeration (IAP): köps i appen via App Store eller Google Play.\n• Företagslicens: tecknas utanför appen via avtal/faktura (per organisation och/eller per användare).\n\n2. Planer och priser\n• Privat: månadsprenumeration, preliminärt 29 kr/månad (inkl. moms). Det exakta priset visas i App Store/Google Play för din region.\n• Företag: plan/pris enligt offert eller prislista (t.ex. per seat eller paketnivåer). Minimiavgift och volymrabatter kan gälla.\n\nVi kan ändra priser/planer framåt i tiden. För privatabonnemang följer vi App Store/Google Plays rutiner för prishöjningar (förhandsinfo + möjlighet att avböja).\n\n3. Betalning\n• Privat (IAP): Betalning hanteras av App Store/Google Play med ditt butikskonto. Vi tar inte emot direktbetalning i appen för privatspåret.\n• Företag: Faktura/Stripe enligt avtal (t.ex. 30 dagar netto). Försening kan medföra dröjsmålsränta och/eller avstängning.\n\n4. Period och förnyelse\n• Prenumeration gäller kalendermånad från köptillfället och förnyas automatiskt tills du säger upp den.\n• Företagslicenser löper enligt avtal (månad/år) och förnyas enligt avtalsvillkoren.\n\n5. Hantera/avsluta prenumeration\n• iOS (App Store): Öppna Inställningar → ditt namn → Abonnemang → välj SERA → Avbryt prenumeration.\n• Android (Google Play): Öppna Google Play → profil → Betalningar & prenumerationer → Prenumerationer → SERA → Avbryt.\nUppsägning gäller från nästa period. Du har tillgång till slutet av aktuell betald period.\n\n6. Ångerrätt och återbetalning (konsument)\n• Ångerrätt: I EU/SE kan digitala abonnemang ha 14 dagars ångerrätt. App Store/Google Play hanterar detta inom sina system.\n• Om du samtycker till omedelbar leverans av digitalt innehåll kan ångerrätten helt/delvis påverkas enligt lag/butikernas villkor.\n• Återbetalning: Begärs via App Store/Google Play. Vi gör normalt inga direkta återbetalningar för IAP-köp.\n\n7. Företag: säten/användare\n• Licensen gäller för organisationen. Admin kan tilldela platser (seats) till användare.\n• Du ansvarar för att endast auktoriserade användare nyttjar licensen och att inlogg delas enligt avtalet (inte mellan personer om inte tillåtet).\n• Vi kan tillämpa rättvis användning och tekniska begränsningar (API-kvoter, samtidighet).\n\n8. Tillgång och avstängning\n• Vid obetald faktura/otillåten användning kan tillgången begränsas eller stängas av.\n• Om ditt butikskonto saknar aktiv prenumeration (privat) eller din org-licens löper ut (företag), kan Tjänsten upphöra att fungera tills betalning/avtal återaktiveras.\n\n9. Ändringar av prenumerationsvillkor\n\nVi kan uppdatera dessa villkor. Vid väsentliga ändringar informerar vi i appen/e-post och/eller via butikernas meddelanden. Fortsatt användning efter ikraftträdande innebär att du godtar ändringarna.\n\n10. Support och kontakt\n• Teknisk support & fakturafrågor SimlinGroup: support@sera.chat\n• IAP-köp (privat): Hanteras primärt via App Store/Google Play.\n• Adress: Ullevivägen 45, 746 51 Bålsta

# startVersion
source: Version 1.0 • For technicians and support teams
sv: Version 1.0 • För tekniker och supportteam

source: Coming soon
sv: Kommer snart

# homeNewChat
source: New chat
sv: Felsökning

# homeSettings
source: Settings
sv: Inställningar

# homeProfile
source: Profile
sv: Profil

# homeSearchHint
source: Search chats…
sv: Sök i chattar…

# homeNoChats
source: No chats yet
sv: Inga chattar ännu

# homeRename
source: Rename
sv: Byt namn

# homeDelete
source: Delete
sv: Radera

# homeRenameDialogTitle
source: Rename chat
sv: Döp om chatt

# homeRenameDialogHint
source: Enter new name
sv: Ange nytt namn

# homeRenameCancel
source: Cancel
sv: Avbryt

# homeRenameSave
source: Save
sv: Spara

# homeCardTroubleshootingTitle
source: Troubleshooting
sv: Felsökning

# homeCardTroubleshootingBadge
source: TROUBLESHOOTING
sv: FELSÖKNING

# homeCardTroubleshootingBody
source: SERA helps you quickly identify faults in heavy equipment with AI-powered analysis. Describe symptoms, get suggested causes and step-by-step fixes. Perfect for field techs and mechanics who need answers fast. Always available and up to date.
sv: SERA hjälper dig att snabbt identifiera fel i entreprenadmaskiner med AI-drivna analyser. Förklara symtom, få förslag på orsaker och steg-för-steg-lösningar. Perfekt för både fälttekniker och mekaniker som behöver snabba svar. Alltid tillgängligt och uppdaterat.

# homeCardMaintenanceTitle
source: Maintenance
sv: Underhåll

# homeCardMaintenanceBadge
source: MAINTENANCE
sv: UNDERHÅLL

# homeCardMaintenanceBody
source: Clear instructions for service, inspections and planned maintenance. SERA guides you through the right intervals, recommended actions and common issues. Less guesswork, more structure. Helps you keep machines reliable longer.
sv: Få tydliga instruktioner för service, inspektion och planerat underhåll. SERA guidar dig genom rätt intervaller, rekommenderade åtgärder och vanliga problem. Mindre gissande, mer struktur. Hjälper dig hålla maskinerna driftsäkra längre.

# homeCardTrainingTitle
source: Training
sv: Utbildning

# homeCardTrainingBadge
source: TRAINING
sv: UTBILDNING

# homeCardTrainingBody
source: SERA Academy offers guides, training and easy-to-read material. Learn functions, systems, installations and safety procedures. Perfect for new technicians or anyone leveling up skills. Everything collected in one simple digital format.
sv: SERA Academy erbjuder guider, utbildningar och lättförståeligt material. Lär dig funktioner, system, installationer och säkerhetsrutiner. Perfekt för nya tekniker eller den som vill utveckla sina färdigheter. Allt samlat i ett enkelt, digitalt format.

# homeCardCommunityBody
source: A forum where technicians, operators and enthusiasts share knowledge and experience. Ask questions, discuss fixes and help others in the industry. Builds a strong community around SERA and heavy equipment. A place to learn, get inspired and grow together.
sv: Ett forum där tekniker, förare och entusiaster kan dela kunskap och erfarenheter. Ställ frågor, diskutera lösningar och hjälp andra i branschen. Bygger en stark gemenskap runt SERA och entreprenadmaskiner. En plats att lära, inspireras och växa tillsammans.

# serviceHeadline
source: Generate a service plan with specifications
sv: Generera en serviceplan med specifikationer

# serviceBrandLabel
source: Brand
sv: Märke

# serviceBrandHint
source: e.g. Volvo, CAT, Komatsu
sv: ex. Volvo, CAT, Komatsu

# serviceModelLabel
source: Model
sv: Modell

# serviceModelHint
source: e.g. EC250E, 320 GC
sv: ex. EC250E, 320 GC

# serviceYearLabel
source: Year
sv: Årsmodell

# serviceYearHint
source: e.g. 2019
sv: ex. 2019

# serviceTypeLabel
source: Service interval
sv: Servicetyp

# serviceTypeYearly
source: Annual service
sv: Årsservice

# serviceTypeAfterRepair
source: Post-repair
sv: Efter reparation

# serviceTypeCustom
source: Custom…
sv: Egen text…

# serviceTypeCustomLabel
source: Custom interval
sv: Egen servicenivå

# serviceTypeCustomHint
source: e.g. 750 h, A-service
sv: ex. 750 h, A-service

# serviceGenerate
source: Generate
sv: Generera

# serviceClear
source: Clear
sv: Rensa

# servicePreviewTitle
source: Preview
sv: Förhandsvisning

# servicePreviewEmpty
source: Your service plan will appear here. Fill in the fields and tap Generate.
sv: Din serviceplan visas här. Fyll i fälten och tryck Generera.

# serviceCopy
source: Copy
sv: Kopiera

# serviceExportPdf
source: Export PDF
sv: Exportera PDF

# serviceCopied
source: Copied
sv: Kopierat

# serviceGeneratedAt
source: Generated
sv: Genererad

# serviceErrorUnauthorized
source: Unauthorized (401) – check proxy or API key.
sv: Behörighetsfel (401) – kontrollera proxy eller API-nyckel.

# serviceErrorGeneric
source: Network error – could not build the service plan.
sv: Nätverksfel – kunde inte skapa serviceplan.

# generalChatTitle
source: General chat
sv: Generell chatt

# generalChatNotice
source: This is the general chat. For machine-specific troubleshooting, use Felsökning. For reports: Arbetsorder. For service plan: Service.
sv: Du är i den generella chatten. För maskinspecifik felsökning – gå till Felsökning. För rapport: Arbetsorder. För serviceplan: Service.

# generalChatInfo
source: Information is guidance only. For targeted troubleshooting, switch to Felsökning.
sv: Informationen är vägledande. För specifik felsökning, använd Felsökning-flödet.

# workOrderCta
source: Work order
sv: Arbetsorder

# workOrderTitle
source: Work order
sv: Arbetsorder

# workOrderHeadline
source: Create work order
sv: Skapa arbetsorder

# workOrderSubhead
source: Describe the job briefly and SERA will generate a concise, professional work order.
sv: Skriv kort vad som ska göras på maskinen så genererar SERA en proffsig arbetsbeskrivning.

# workOrderDescriptionLabel
source: Description
sv: Beskrivning

# workOrderDescriptionHint
source: Example: Replace hydraulic filter on Volvo EC250E, check for leaks, verify pressure after replacement.
sv: Exempel: Byta hydraulfilter på Volvo EC250E, kontrollera läckage, verifiera tryck efter byte.

# workOrderGenerate
source: Generate
sv: Generera

# workOrderClear
source: Clear
sv: Rensa

# workOrderPreviewTitle
source: Preview
sv: Förhandsvisning

# workOrderPreviewEmpty
source: Your generated work order will show here. Add a short description and tap Generate.
sv: Här visas den genererade arbetsordern. Skriv en kort beskrivning och tryck Generera.

# workOrderCopy
source: Copy
sv: Kopiera

# workOrderExportPdf
source: Export PDF
sv: Exportera PDF

# workOrderCopied
source: Copied
sv: Kopierat

# workOrderPdfTitle
source: Work order
sv: Arbetsorder

# workOrderGeneratedAt
source: Generated
sv: Genererad

# workOrderPdfFileName
source: work-order.pdf
sv: arbetsorder.pdf
