Repository: KristofferSimlin/SERA_Home
Catalog: l10n/app_*.arb
Languages: sv

# workOrderErrorUnauthorized
source: Unauthorized (401) – check proxy or API key.
sv: Behörighetsfel (401) – kontrollera proxy eller API-nyckel.

# workOrderErrorGeneric
source: Network error – could not build the work order.
sv: Nätverksfel – kunde inte skapa arbetsorder.

# sidebarTipsTitle1
source: Troubleshooting – engine will not start
sv: Felsökning – motor startar inte

# sidebarTipsTitle2
source: Read fault code & next steps
sv: Läs felkod & nästa steg

# sidebarTipsTitle3
source: Maintenance – checklist
sv: Underhåll – checklista

# sidebarTipsTitle4
source: Safety advice – hydraulics
sv: Säkerhetsråd – hydraulik

# homeHeroDescription
source: SERA is your AI assistant for heavy equipment—from troubleshooting to installation. Soon complemented by SERA Academy and a community forum where you can learn, share experience, and get help from peers.
sv: SERA är din AI-assistent för entreprenadmaskiner – från felsökning till installation. Snart kompletterad med SERA Academy och ett community-forum där du kan lära, dela erfarenheter och få stöd av andra i branschen.

# settingsTitle
source: Settings
sv: Inställningar

# settingsConnection
source: Connection
sv: Anslutning

# settingsProxyToggle
source: Proxy mode (recommended)
sv: Proxy-läge (rekommenderas)

# settingsProxySubtitle
source: Hides API key and can add web search /search
sv: Döljer API-nyckel och kan lägga till webbsök /search

# settingsProxyUrlHelper
source: Enter only the URL (not "PROXY_URL=").
sv: Ange ENDAST URL:en (inte "PROXY_URL=" framför).

# settingsDirectKeyLabel
source: OPENAI_API_KEY (direct mode)
sv: OPENAI_API_KEY (direktläge)

# settingsDirectKeyHelper
source: Use only for local testing. Never ship key in production.
sv: Använd bara för lokal test. Lägg aldrig nyckeln i produktion.

# settingsProxyTip
source: Tip: Use proxy mode in production. Direct mode exposes the key in the client.
sv: Tips: Kör proxy-läge i produktion. Direktläge exponerar nyckeln i klienten.

# settingsWebSearchTitle
source: Web search (beta)
sv: Webbsök (beta)

# settingsWebSearchToggle
source: Enable web search via proxy /search
sv: Aktivera webbsök via proxy /search

# settingsWebSearchSubtitle
source: Requires PROXY_SEARCH_URL in .env and /search route in proxy
sv: Kräver PROXY_SEARCH_URL i .env och route /search i proxyn

# settingsWebSearchInfo
source: When enabled, SERA fetches relevant sources (manuals, forums, technical sites) for your make/model/year and weaves findings into the answer.
sv: När detta är på försöker SERA hämta relevanta källor (manualer, forum, tekniska sidor) för ditt märke/modell/årsmodell och väver in fynden i svaret.

# settingsLanguageLabel
source: Language
sv: Språk

# settingsSafetyTitle
source: Safety
sv: Säkerhet

# profileTitle
source: Profile
sv: Profil

# profileDataTitle
source: Profile & data
sv: Profil & data

# profileDataInfo
source: Erase locally stored data (sessions, messages, equipment). Required for App Store data deletion.
sv: Rensa lokalt sparad data (sessioner, meddelanden, utrustning). Krav från App Store för dataradering.

# profileDelete
source: Delete stored data
sv: Radera lagrad data

# profileDeleteConfirmTitle
source: Delete all stored data?
sv: Radera all lagrad data?

# profileDeleteConfirmBody
source: This deletes local sessions, messages and equipment selections. This cannot be undone.
sv: Detta raderar lokala sessioner, meddelanden och utrustningsval. Åtgärden går inte att ångra.

# profileDeleteCancel
source: Cancel
sv: Avbryt

# profileDeleteConfirm
source: Delete
sv: Radera

# profileDeleteDone
source: All local data deleted
sv: All lokal data raderad

source: Error
sv: Fel

# profileComingSoonTitle
source: Coming soon
sv: Kommer snart

# profileComingSoonBody
source: Here we will add login, quick equipment presets and other profile settings.
sv: Här lägger vi till inloggning, snabbval av utrustning och andra profilinställningar.

# privacyTitle
source: Privacy Policy
sv: Integritetspolicy

# privacyUpdated
source: Last updated: 2025-11-29
sv: Senast uppdaterad: 2025-11-29

# privacyApplies
source: Applies to: SERA (iOS, Android and Web)
sv: Gäller för: SERA (iOS, Android och Web)

# privacyBody
source: For full details, see the policy text.
sv: Se hela policyn nedan.

# privacyFull
source: Privacy Policy – SERA Last updated: 2025-11-29 Applies to: SERA (iOS, Android and Web) 1. Who is the controller? Company: SimlinGroup Address: Ullevivägen 45, 746 51 Bålsta Email: support@sera.chat We are responsible for processing personal data when you use SERA. 2. Summary • SERA helps you troubleshoot equipment and provides chat functionality. • Your chat content and equipment data (e.g., brand, model, year) go via our server ("proxy") to a third-party AI provider that uses data from our own knowledge library to generate answers. • All traffic uses HTTPS. We do not sell your personal data. • You can request deletion of chat logs and exercise GDPR rights (see section 11). 3. What data we collect Depending on how you use SERA, we may process these categories: A. User content • Text you enter in chat, selected equipment fields (brand, model, year), any attached images/notes. B. Technical data & logs • IP address (in server logs), timestamps, device/browser info (for troubleshooting and security). • Crash and performance data if you consent in the app. C. Account data (if accounts are introduced) • Name, email, authentication details, payment-related data (handled via payment partner). D. Support • Messages you send to support and related correspondence. We do not collect exact geolocation. Camera access, microphone, notifications, etc. are used only if you explicitly enable such a feature. 4. Why we process data (purpose and legal basis) • Deliver the service (contract): Generate answers and troubleshooting steps, store history for you, show sources. • Security & abuse prevention (legitimate interest): Detect spam/abuse, protect the system. • Improvement & diagnostics (legitimate interest or consent): Performance, crash logs, quality follow-up. • Legal obligations: e.g., bookkeeping, handling legal claims. • Marketing/communication (consent): Only if you actively agree. 5. How AI answers are generated and how SERA’s knowledge library is used When you use chat, your message and any equipment info are sent to our server/proxy. The proxy forwards necessary content to a third-party AI provider to generate an answer. To improve quality and precision, SERA also uses its own curated knowledge library ("SERA’s library"). How it works (RAG): • 1) Your question: Your chat content and selected equipment fields (brand, model, year) are received by our server. • 2) Search SERA’s library: Our server searches for relevant excerpts in SERA’s library (e.g., manuals, service bulletins, safety notices, technical facts we are allowed to use). • 3) Minimal sharing: Only the necessary excerpts plus your question (and equipment fields) are sent to the AI provider to generate the answer. We do not send entire documents unless needed to fulfill your request. • 4) Answer + sources: The AI answer is returned to the app, often with citations to the library sources used. About SERA’s library: • Owned and maintained by SERA; contains content we are allowed to use (own, licensed, or legally permitted). • Does not contain your personal data. Individual chat content is not added to the library, except possibly in aggregated/anonymized form to improve coverage and quality. • The library can be stored and updated independently of your app installation (so you get improvements without updating the app). Third-party AI provider: • Configured so data is not used for general model training where such controls exist. • May retain limited logs for a short time to prevent abuse and ensure operation. • All communication uses HTTPS. Your control: • Do not share sensitive personal data (e.g., health data, national ID). • If you do not want your chat content shared with the AI provider, refrain from using the chat feature; other parts of the app may be limited. • You can request deletion of chat logs under GDPR (see §11). 6. Sharing We do not sell your personal data. We may share data with: • Third-party AI provider (only to generate the answer you request). • Infrastructure partners (hosting, CDN, email, log management). • Payment partner (if purchases are introduced). • Authorities if required by law or to protect rights/safety. All parties process data under agreements (e.g., data processing agreements). 7. Transfers outside EU/EEA Some recipients may be outside the EU/EEA (e.g., US). We use appropriate safeguards such as Standard Contractual Clauses (SCC). Contact us for more information. 8. Retention • Chat content: By default up to 12 months, or until you delete it in the app or request deletion. • Server logs (IP, errors, performance): Up to 90 days for troubleshooting/security. • Account data (if applicable): As long as the account is active and thereafter as required by law. We may anonymize/aggregate data for statistics. 9. Security We use technical and organizational measures to protect data, including encryption in transit (HTTPS), access controls, and logging. No method is 100% secure, but we continuously improve. 10. Cookies and local storage (Web) On the web, we may use necessary cookies and/or localStorage/IndexedDB for settings, session management, and cache. Analytics or marketing cookies are used only if you consent. 11. Your rights (GDPR) You have the right to: • Access your personal data, • Request correction or deletion, • Request restriction of processing, • Object to processing based on legitimate interest, • Data portability in some cases, • Withdraw consent when processing is based on consent. Contact us at support@sera.chat. You can also file a complaint with the relevant supervisory authority. 12. Children SERA is not directed to children. If you believe a child under 16 has provided data, contact us and we will remove it. 13. Your choices and controls • You can disable collection of crash/diagnostic data at any time (if available). • You can clear chat in the app and ask us to delete associated server logs. • AI consent: at first chat use, we show a clear dialog. You can opt out; some features may then be limited. 14. Third-party links and sources SERA may show source links (e.g., to manuals, documentation). We are not responsible for third-party websites and their policies. 15. Changes We may update this policy. The new version will be published here with an updated date. For major changes, we will notify in-app or via email (if available). 16. Contact Questions about privacy? Contact: support@sera.chat Mail: Ullevivägen 45, 746 51 Bålsta
sv: Integritetspolicy – SERA\n\nSenast uppdaterad: 2025-11-29\nGäller för: SERA (iOS, Android och Web)\n\n1. Vem är personuppgiftsansvarig?\n\nFöretag: SimlinGroup\nAdress: Ullevivägen 45, 746 51 Bålsta\nE-post: support@sera.chat\n\nVi ansvarar för behandlingen av personuppgifter i samband med din användning av SERA.\n\n2. Kort sammanfattning\n• SERA låter dig felsöka maskinproblem och chattfunktionalitet.\n• Ditt chattinnehåll och utrustningsdata (t.ex. märke, modell, årsmodell) skickas via vår server ("proxy") till en tredjeparts AI-leverantör som sedan använder sig av information från vårat egna kunskapsbibliotek för att generera svar.\n• All trafik sker över HTTPS. Vi säljer inte dina personuppgifter.\n• Du kan begära radering av chattloggar och utöva dina GDPR-rättigheter (se avsnitt 11).\n\n3. Vilka uppgifter samlar vi in?\n\nBeroende på hur du använder SERA kan vi behandla följande kategorier:\n\nA. Användarinnehåll\n• Text du skriver i chatten, valda utrustningsfält (märke, modell, årsmodell), ev. bifogade bilder/anteckningar.\n\nB. Tekniska data & loggar\n• IP-adress (i serverloggar), tidsstämplar, enhets- och webbläsarinfo (för felsökning och säkerhet).\n• Krasch- och prestandadata om du samtycker till det i appen.\n\nC. Kontouppgifter (om konton införs)\n• Namn, e-post, autentiseringsuppgifter, betalningsrelaterade uppgifter (hanteras via betalpartner).\n\nD. Support\n• Meddelanden du skickar till support och relaterad korrespondens.\n\nVi samlar inte in exakt geolokalisering. Kamerabibliotek, mikrofon, notiser etc. används bara om du uttryckligen aktiverar en sådan funktion.\n\n4. Varför behandlar vi uppgifterna? (ändamål och rättslig grund)\n• Leverera tjänsten (avtal): Generera svar och felsökningsförslag, spara historik till dig, visa källor.\n• Säkerhet & missbruksförebyggande (berättigat intresse): Upptäcka spam/missbruk, skydda system.\n• Förbättring & felsökning (berättigat intresse eller samtycke): Prestanda, kraschloggar, kvalitetsuppföljning.\n• Juridiska skyldigheter (rättslig förpliktelse): Ex. bokföring, hantering av rättsliga krav.\n• Marknad/kommunikation (samtycke): Endast om du aktivt har godkänt.\n\n5. Hur genereras AI-svar och hur används SERA:s kunskapsbibliotek?\n\nNär du använder chatten skickas ditt meddelande och eventuell utrustningsinformation från appen till vår server/proxy. Proxyn vidarebefordrar nödvändigt innehåll till en tredjeparts AI-leverantör för att generera ett svar. För att förbättra kvalitet och precision använder SERA även ett eget, kuraterat kunskapsbibliotek ("SERA:s bibliotek").\n\nSå här fungerar det i korthet:\n• 1) Din fråga: Ditt chattinnehåll och valda utrustningsfält (märke, modell, årsmodell) tas emot av vår server.\n• 2) Sök i SERA:s bibliotek: Vår server söker efter relevanta utdrag i SERA:s bibliotek (t.ex. manualer, servicebulletiner, säkerhetsföreskrifter och tekniska fakta som vi får använda).\n• 3) Minimal delning: Endast de nödvändiga utdragen från biblioteket samt din fråga (och utrustningsfält) skickas vidare till AI-leverantören för att generera svaret. Vi delar inte hela dokument om det inte behövs för att uppfylla din förfrågan.\n• 4) Svar + källor: AI-svaret returneras till appen, ofta med källhänvisningar till de biblioteksposter som användes.\n\nOm SERA:s bibliotek:\n• Biblioteket ägs och förvaltas av SERA och består av innehåll som vi har rätt att använda (eget material, licensierat material eller material som omfattas av lagliga undantag).\n• Biblioteket innehåller inte dina personuppgifter. Vi för inte in individuellt chattinnehåll i biblioteket, annat än möjligen i aggregerad/anonymiserad form för att förbättra täckning och kvalitet.\n• Biblioteket kan lagras och uppdateras löpande oberoende av din appinstallation (så att du får förbättringar utan att uppdatera appen).\n\nTredjeparts AI-leverantör:\n• Vi konfigurerar leverantören så att data inte används för generell modellträning där sådana kontroller finns tillgängliga.\n• Leverantören kan behålla begränsade loggar under en kort period för att motverka missbruk och säkerställa driften.\n• All kommunikation sker över HTTPS.\n\nDin kontroll:\n• Dela inte känsliga personuppgifter i chatten (t.ex. hälsodata, personnummer).\n• Om du inte vill att ditt chattinnehåll ska delas med en tredjeparts AI-leverantör kan du avstå från att använda chattfunktionen; andra delar av appen kan vara begränsade.\n• Du kan begära radering av chattloggar enligt GDPR (se §11).\n\n6. Delning av uppgifter\n\nVi delar inte dina personuppgifter för försäljning. Vi kan dela uppgifter med:\n• Tredjeparts AI-leverantör (endast för att generera det svar du begär).\n• Drift- och infrastrukturpartners (hosting, CDN, e-post, logghantering).\n• Betalpartner (om köp införs).\n• Myndigheter om lagen kräver det eller för att skydda rättigheter/säkerhet.\n\nAlla parter behandlar uppgifter enligt avtal (personuppgiftsbiträdesavtal eller motsvarande).\n\n7. Överföring utanför EU/EES\n\nVissa mottagare kan finnas i länder utanför EU/EES (t.ex. USA). Vi säkerställer lämpliga skyddsåtgärder, t.ex. Standardavtalsklausuler (SCC). Du kan kontakta oss för mer information om tillämpliga skydd.\n\n8. Lagringstider\n• Chattinnehåll: Som standard upp till 12 månader, eller tills du raderar det i appen eller begär radering.\n• Serverloggar (IP, fel, prestanda): upp till 90 dagar för felsökning/säkerhet.\n• Kontodata (om tillämpligt): så länge kontot är aktivt och därefter enligt rättsliga krav. Vi kan anonymisera/aggreggera data för statistik.\n\n9. Säkerhet\n\nVi använder tekniska och organisatoriska åtgärder för att skydda uppgifter, inklusive kryptering i transit (HTTPS), åtkomstkontroller och loggning. Ingen metod är 100 % säker, men vi arbetar kontinuerligt med förbättringar.\n\n10. Cookies och lokal lagring (Web)\n\nPå webben kan vi använda nödvändiga cookies och/eller localStorage/IndexedDB för inställningar, sessionshantering och cache. Analys- eller marknadsföringscookies används endast om du samtycker.\n\n11. Dina rättigheter (GDPR)\n\nDu har rätt att:\n• få tillgång till dina personuppgifter,\n• begära rättning eller radering,\n• begära begränsning av behandling,\n• invända mot behandling som sker med stöd av berättigat intresse,\n• få dataportabilitet i vissa fall,\n• återkalla samtycke när behandling grundas på samtycke.\n\nKontakta oss på support@sera.chat. Du kan även lämna klagomål till Integritetsskyddsmyndigheten (IMY) eller motsvarande tillsynsmyndighet inom EU.\n\n12. Barns integritet\n\nSERA riktar sig inte till barn. Om du tror att ett barn under 16 har lämnat uppgifter till oss, kontakta oss så tar vi bort informationen.\n\n13. Dina val och kontroller\n• Du kan när som helst stänga av insamling av krasch/diagnostik (om funktionen finns).\n• Du kan rensa chatt i appen och be oss radera serverloggar som är kopplade till dig.\n• Samtycke för AI-behandling: vid första chattanvändningen visar vi en tydlig dialog. Du kan välja att inte fortsätta; då kan vissa funktioner vara begränsade.\n\n14. Tredjepartslänkar och källor\n\nSERA kan visa källhänvisningar (t.ex. till manualer, dokumentation). Vi ansvarar inte för tredjeparts webbplatser och deras policys.\n\n15. Förändringar i policyn\n\nVi kan uppdatera denna policy. Ny version publiceras här med uppdaterat datum. Vid väsentliga ändringar informerar vi i appen eller via e-post (om uppgifter finns).\n\n16. Kontakt\n\nFrågor om integritet? Kontakta: support@sera.chat\nPostadress: Ullevivägen 45, 746 51 Bålsta

# chatAppBarTitle
source: SERA – Chat
sv: SERA – Chatt

# chatBrandLabel
source: Brand
sv: Märke

# chatBrandHint
source: e.g. Volvo, CAT, Wacker Neuson
sv: ex. Volvo, CAT, Wacker Neuson

# chatModelLabel
source: Model
sv: Modell

# chatModelHint
source: e.g. EC250E, 320 GC
sv: ex. EC250E, 320 GC

# chatYearLabel
source: Year
sv: Årsmodell

# chatYearHint
source: e.g. 2019
sv: ex. 2019

# chatExpertiseLabel
source: Expertise
sv: Kunskapsnivå

# chatExpertise1
source: 1 – Beginner
sv: 1 – Nybörjare

# chatExpertise2
source: 2 – Intermediate
sv: 2 – Medel

# chatStatusTitle
source: Selected: {equipment}
sv: Vald: {equipment}

# chatStatusNone
source: No equipment selected yet.
sv: Ingen utrustning vald ännu.

# chatStatusLocked
source: • Locked
sv: • Låst

# chatStatusLevel
source: • Level: {level}
sv: • Nivå: {level}

# chatClear
source: Reset
sv: Byt

# chatLock
source: Lock
sv: Lås

# chatSave
source: Save
sv: Spara

# chatInfo
source: Information is guidance only. Follow manufacturer instructions and local safety rules. Use at your own risk.
sv: Informationen är vägledande. Följ alltid tillverkarens instruktioner och lokala säkerhetsregler. Egen risk.

# chatInputHint
source: Type a message…
sv: Skriv ett meddelande…

# chatSend
source: Send
sv: Skicka

# chatSafetyBanner
source: Safety filter: Disconnect power, relieve pressure, ventilate when handling fuel. Use PPE. Always follow manufacturer instructions.
sv: Säkerhetsfilter: Koppla från ström, avlasta tryck, ventilera vid bränslearbete. Använd skyddsutrustning. Följ alltid tillverkarens instruktioner.

# chatSafetyHide
source: Hide safety notice
sv: Dölj säkerhetsfilter

# chatSafetyShow
source: Show safety notice
sv: Visa säkerhetsfilter

# chatThinkingPreparing
source: Thinking…
sv: Tänker …

# chatThinkingGathering
source: Gathering info from the knowledge base…
sv: Samlar information från kunskapsbiblioteket …

# chatThinkingComposing
source: Composing a reply…
sv: Lägger ihop ett svar …
